#+TITLE: Advent of code 2020
#+PROPERTY: header-args :results output 

*** DONE Solution

#+BEGIN_SRC js
const fs = require('fs')
fs.readFile('day1-input.txt', 'utf-8', (err, data) => {
    console.log('result:', parseList(data))
})

function parseList(list) {
    const entries = list.split(/\r?\n/).map(entry => parseInt(entry, 10)
)
    // brute force
    // not even removing duplicate (299+675 vs 675+299)
    for (let a = entries.length-1; a >= 0; a--) {
        for (let b = entries.length-1; b >= 0; b--) {
            if (entries[a]+entries[b] === 2020) {
                return entries[a]*entries[b]
            }
        }
    }
}
#+END_SRC

#+RESULTS:
: result: 211899

*** TODO Solution
#+BEGIN_SRC js
const fs = require('fs')
fs.readFile('day1-input.txt', 'utf-8', (err, data) => {
    console.log('result:', parseList(data))
})

function parseList(list) {
    const entries = list.split(/\r?\n/).map(entry => parseInt(entry, 10)
)
    // brute force
    // not even removing duplicate (299+675 vs 675+299)
    for (let a = entries.length-1; a >= 0; a--) {
        for (let b = entries.length-1; b >= 0; b--) {
            for (let c = entries.length-1; c >= 0; c--) {
                if (entries[a]+entries[b]+entries[c] === 2020) {
                    return entries[a]*entries[b]*entries[c]
                }
            }
        }
    }
}
#+END_SRC

#+RESULTS:
: result: 275765682


